In [1]:
pwd

'/Users/rahulgarg/github/aux_ai_engine/pycodes'

In [3]:
open('rahul.txt')

In [82]:
fhand = open('rahul.txt')

In [83]:
fhand

In [84]:
count =0

In [85]:
for i in fhand:
    count = count+1

In [86]:
count

4

In [52]:
fhand.read()

"The 2020 World Snooker Championship was a professional snooker tournament held from 31 July to 16 August 2020 at the Crucible Theatre in Sheffield. It was originally scheduled to take place from 18 April to 4 May, but qualification and the main rounds were postponed due to the COVID-19 pandemic in the United Kingdom. The event was intended to allow limited live audiences, but apart from the first day and the final it was played behind closed doors. The tournament was organised by the World Snooker Tour, broadcast by the BBC, Eurosport and Matchroom Sport, and sponsored by sports betting company Betfred. It had a total prize fund of £2,395,000, with the winner receiving £500,000. The delayed qualifying rounds took place from 21 to 28 July, involving 128 professional and invited amateur participants. The top 16 reached the main stage of the tournament where they played the top 16 ranked players. Judd Trump, the defending champion, lost in the quarter-final stage to Kyren Wilson. Ronnie O'Sullivan (pictured) won his sixth world title, defeating Wilson 18–8 in the final.\n\n\nthis is a new line"

In [68]:
csv_file = open('simulated_signature_data.csv')

In [69]:
count = 0

In [70]:
for i in csv_file:
    count = count+1

In [71]:
count

251

In [72]:
type(csv_file)

_io.TextIOWrapper

In [87]:
open('rahul.txt', mode = 'r')

In [94]:
vidit = open('vidit.txt', mode = 'w')

In [98]:
type(vidit)

_io.TextIOWrapper

In [95]:
vidit.write('This is a test file')

19

In [96]:
vidit.close()

In [99]:
with open('vidit.txt', mode = 'w') as vidit:
    vidit.write('This is a test file using WITH')

In [101]:
vidit.closed

True

In [114]:
import pandas as pd

In [115]:
adv = pandas.read_csv('/Users/rahulgarg/github/AnalyticsCourse/datasets/Advertising.csv', index_col = 0)
adv

        TV  Radio  Newspaper  Sales
1    230.1   37.8       69.2   22.1
2     44.5   39.3       45.1   10.4
3     17.2   45.9       69.3    9.3
4    151.5   41.3       58.5   18.5
5    180.8   10.8       58.4   12.9
..     ...    ...        ...    ...
196   38.2    3.7       13.8    7.6
197   94.2    4.9        8.1    9.7
198  177.0    9.3        6.4   12.8
199  283.6   42.0       66.2   25.5
200  232.1    8.6        8.7   13.4

[200 rows x 4 columns]

In [116]:
type(adv)

pandas.core.frame.DataFrame

In [117]:
adv.columns

Index(['TV', 'Radio', 'Newspaper', 'Sales'], dtype='object')

In [118]:
adv.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            191, 192, 193, 194, 195, 196, 197, 198, 199, 200],
           dtype='int64', length=200)

In [127]:
s1 = pd.Series([1,4,9,16,25])
s1

0     1
1     4
2     9
3    16
4    25
dtype: int64

In [121]:
type(s)

pandas.core.series.Series

In [129]:
s1[4]

25

In [131]:
s2['e']

25

In [155]:
lst = [1,2,4]

In [156]:
s1[lst]

1     4
2     9
4    25
dtype: int64

In [160]:
s1<=4

0     True
1     True
2    False
3    False
4    False
dtype: bool

In [161]:
s1[s1<=4]

0    1
1    4
dtype: int64

In [164]:
s1

0      1
1     16
2     81
3    256
4    625
dtype: int64

In [132]:
adv

        TV  Radio  Newspaper  Sales
1    230.1   37.8       69.2   22.1
2     44.5   39.3       45.1   10.4
3     17.2   45.9       69.3    9.3
4    151.5   41.3       58.5   18.5
5    180.8   10.8       58.4   12.9
..     ...    ...        ...    ...
196   38.2    3.7       13.8    7.6
197   94.2    4.9        8.1    9.7
198  177.0    9.3        6.4   12.8
199  283.6   42.0       66.2   25.5
200  232.1    8.6        8.7   13.4

[200 rows x 4 columns]

In [162]:
adv>100

        TV  Radio  Newspaper  Sales
1     True  False      False  False
2    False  False      False  False
3    False  False      False  False
4     True  False      False  False
5     True  False      False  False
..     ...    ...        ...    ...
196  False  False      False  False
197  False  False      False  False
198   True  False      False  False
199   True  False      False  False
200   True  False      False  False

[200 rows x 4 columns]

In [149]:
adv.loc[195:200, :]

        TV  Radio  Newspaper  Sales
195  149.7   35.6        6.0   17.3
196   38.2    3.7       13.8    7.6
197   94.2    4.9        8.1    9.7
198  177.0    9.3        6.4   12.8
199  283.6   42.0       66.2   25.5
200  232.1    8.6        8.7   13.4

In [464]:
titanic = pd.read_csv('/Users/rahulgarg/github/AnalyticsCourse/datasets/titanic/train.csv')

In [465]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [169]:
titanic['survived_converted'] = np.where(titanic.Survived == 1, True, False)

In [170]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,survived_converted
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,False
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,True
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,True
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,True
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,False
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,True
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,False
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,True
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,False

In [171]:
titanic.dtypes

PassengerId             int64
Survived                int64
Pclass                  int64
Name                   object
Sex                    object
Age                   float64
SibSp                   int64
Parch                   int64
Ticket                 object
Fare                  float64
Cabin                  object
Embarked               object
survived_converted       bool
dtype: object

In [543]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
t

In [461]:
len(titanic)

890

In [ ]:
# built in function
# Methods
# Attributes

In [462]:
l.columns

AttributeError: 'list' object has no attribute 'columns'

In [473]:
titanic.columns # Attribute

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [475]:
titanic.index

RangeIndex(start=0, stop=891, step=1)

In [476]:
type(titanic)

pandas.core.frame.DataFrame

In [471]:
titanic.shape # Attribute

(891, 12)

In [544]:
titanic.describe(include = 'all') # Method to a dataframe

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Olsen, Mr. Ole Martin",male,NaN,NaN,NaN,CA. 2343,NaN,B96 B98,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

In [550]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [558]:
titanic.loc[titanic.Sex == 'male'].Survived.value_counts(normalize = True)

0    0.811092
1    0.188908
Name: Survived, dtype: float64

In [559]:
titanic.loc[titanic.Sex == 'female'].Survived.value_counts(normalize = True)

1    0.742038
0    0.257962
Name: Survived, dtype: float64

In [ ]:
10 male 20 females

In [561]:
10*0.18+20*0.74

16.6

In [562]:
20*0.74

14.8

In [545]:
titanic.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [546]:
titanic.Sex.value_counts(normalize = True)

male      0.647587
female    0.352413
Name: Sex, dtype: float64

In [547]:
titanic.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [549]:
titanic.Survived.value_counts(normalize = True)

0    0.616162
1    0.383838
Name: Survived, dtype: float64

In [534]:
type(titanic.describe())

pandas.core.frame.DataFrame

In [542]:
titanic.describe().Survived['max']

1.0

In [218]:
df = pd.DataFrame(['1',4,9,16,'25','rahul'], columns = ['sq'])
df

      sq
0      1
1      4
2      9
3     16
4     25
5  rahul

In [219]:
df.dtypes

sq    object
dtype: object

In [220]:
df.loc[0]+df.loc[4]

sq    125
dtype: object

In [205]:
25+5

30

In [206]:
'25'+'5'

'255'

In [176]:
pd.Series([1,4,9,16,25], name = 'sq')

0     1
1     4
2     9
3    16
4    25
Name: sq, dtype: int64

In [178]:
string = 'my name is rahul'

In [179]:
type(string)

str

In [181]:
string[1]

'y'

In [182]:
len(string)

16

In [183]:
string[2]

' '

In [192]:
lst = list('my', 'name','is', 'rahul')

TypeError: 'list' object is not callable

In [185]:
lst = ['my', 'name','is', 'rahul']

In [186]:
len(lst)

4

In [198]:
lst[1][4]

IndexError: string index out of range

In [191]:
lst

AttributeError: 'list' object has no attribute 'values'

In [222]:
titanic.loc[1,'Name']

'Cumings, Mrs. John Bradley (Florence Briggs Thayer)'

In [226]:
titanic.loc[2,'Name']

'Cumings, Mrs. John Bradley (Florence Briggs Thayer)'

In [235]:
titanic = pd.read_csv('/Users/rahulgarg/github/AnalyticsCourse/datasets/titanic/train.csv')

In [236]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [239]:
titanic = titanic.set_index('PassengerId')

In [240]:
titanic

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [242]:
titanic.loc[889, 'Ticket']

'W./C. 6607'

In [232]:
titanic = titanic.reset_index()

In [233]:
titanic.iloc[888, 7]

2

In [234]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [244]:
titanic = pd.read_csv('/Users/rahulgarg/github/AnalyticsCourse/datasets/titanic/train.csv', header = None)

In [245]:
titanic

,0,1,2,3,4,5,6,7,8,9,10,11
0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,NaN,S
2,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
3,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.925,NaN,S
4,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1,C123,S
...,...,...,...,...,...,...,...,...,...,...,...,...
887,887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13,NaN,S
888,888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30,B42,S
889,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
890,890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30,C148,C
891,891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.75,NaN,Q

In [246]:
titanic.loc[0,0]

'PassengerId'

In [247]:
titanic.iloc[0,0]

'PassengerId'

In [258]:
titanic.drop(1, axis = 0, inplace = True)
titanic.drop(1, axis = 1, inplace = True)

In [259]:
titanic

,2,3,4,5,6,7,8,9,10,11
2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
3,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.925,NaN,S
4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1,C123,S
5,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.05,NaN,S
6,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
...,...,...,...,...,...,...,...,...,...,...
887,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13,NaN,S
888,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30,B42,S
889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
890,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30,C148,C
891,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.75,NaN,Q

In [266]:
titanic.loc[2,2]

'1'

In [267]:
titanic.iloc[2,2]

'female'

In [268]:
string = 'example string'

In [269]:
type(string)

str

In [270]:
string = "example string"

In [271]:
type(string)

str

In [272]:
type(5)

int

In [273]:
type(5.2)

float

In [274]:
5+6

11

In [277]:
rahul1 = "example string"

In [287]:
_abc = "example string"

In [288]:
_abc

'example string'

In [290]:
break = "example string"

SyntaxError: invalid syntax (<ipython-input-290-25cf0f3311d9>, line 1)

In [ ]:
dict

In [296]:
lst =  "example string"

In [297]:
list

'example string'

In [295]:
print("example string")

TypeError: 'str' object is not callable

In [298]:
list([1,2,3])

TypeError: 'str' object is not callable

In [301]:
print('rahul')

rahul

In [300]:
del print

In [302]:
print('1')
print('2')
pritn('3')

1
2

NameError: name 'pritn' is not defined

In [303]:
 = # assingment operator
==

SyntaxError: invalid syntax (<ipython-input-303-38a31a483634>, line 1)

In [305]:
r = 5

In [306]:
r

5

In [308]:
r == 5

True

In [309]:
1+5-2

4

In [312]:
1+5/2*2

6.0

In [313]:
7/3

2.3333333333333335

In [314]:
7//3

2

In [315]:
7%3

1

In [316]:
string = 'my name is rahul'

In [318]:
len(string)

16

In [320]:
string[15]

'l'

In [321]:
string[-2]

'u'

In [323]:
del list

In [328]:
lst = list([1.2, 'name','is', 'rahul'])

In [329]:
lst

[1.2, 'name', 'is', 'rahul']

In [327]:
lst[-1]

'rahul'

In [330]:
lst[0]

1.2

In [334]:
x = 5

In [335]:
2*x + 3

13

In [338]:
a = 2*x + 3

In [337]:
a

13

In [357]:
name = 'Michael Jordan'

In [340]:
name

'michael jordan'

In [348]:
name[:7]

'michael'

In [352]:
name[7:]

' jordan'

In [354]:
name.upper()

'MICHAEL JORDAN'

In [358]:
name.islower()

False

In [361]:
name.lower()

'michael jordan'

In [362]:
name.

NameError: name 'lower' is not defined

In [379]:
t = ['d', 'c', 'e', 'b', 'a']

In [364]:
type(t)

list

In [368]:
print(t.sort())

None

In [370]:
sorted(t)

['a', 'b', 'c', 'd', 'e']

In [ ]:
t.

In [366]:
t

['a', 'b', 'c', 'd', 'e']

In [373]:
def rahul():
    return 1

In [374]:
rahul()

1

In [380]:
x = t.sort()

In [381]:
t

['a', 'b', 'c', 'd', 'e']

In [383]:
print(x)

None

In [390]:
l = ['a', 'b', 'c', 'd', 'e']

In [391]:
type(l)

list

# Tuple

In [393]:
t = 'a', 'b', 'c', 'd', 'e'

In [394]:
type(t)

tuple

In [396]:
t

('a', 'b', 'c', 'd', 'e')

In [397]:
t = ('a', 'b', 'c', 'd', 'e')

In [398]:
type(t)

tuple

In [399]:
t

('a', 'b', 'c', 'd', 'e')

In [407]:
t = tuple(['a', 'b', 'c', 'd', 'e'])

In [408]:
t

('a', 'b', 'c', 'd', 'e')

In [409]:
type(t)

tuple

In [410]:
t[0]

'a'

In [412]:
t[1:4]

('b', 'c', 'd')

In [413]:
t[1] = 'z'

TypeError: 'tuple' object does not support item assignment

In [414]:
t.append('z')

AttributeError: 'tuple' object has no attribute 'append'

In [420]:
(0, 1, 200) < (0, 2 , 1)

True

In [421]:
(rahul, vidit) = (100, 200)

In [430]:
(a, b, c, d) = [1, 2, 3, 4]

In [437]:
lst = [1, 2, 3, 4, 5]

In [438]:
(a, b, c, d) = lst

ValueError: too many values to unpack (expected 4)

In [436]:
a

1

In [493]:
t = 7,6,5,4,3,2,1

In [494]:
t

(7, 6, 5, 4, 3, 2, 1)

In [495]:
sorted(t)

[1, 2, 3, 4, 5, 6, 7]

In [496]:
for i in reversed(t):
    print(i)

1
2
3
4
5
6
7

In [447]:
t.count(1)

5

In [497]:
l = [1,2,3,1,1,1,1]

# Sets

In [504]:
x = {1,2,3,1,1,1,1}

In [505]:
x.add(10)

In [506]:
x

{1, 2, 3, 10}

In [509]:
x.remove(3)

In [510]:
x

{1, 2, 10}

In [513]:
y = {1,1,1,1,1, 2,2,2, 5,5}
y

{1, 2, 5}

In [529]:
z = {2,2,2, 5,5,5, 10,10, 20}
z

{2, 5, 10, 20}

In [521]:
x & y & z

{2}

In [522]:
x.difference(y)

{10}

In [532]:
list(x.union(y))

[1, 2, 5, 10]

In [533]:
x.union(y).union(y)

{1, 2, 5, 10}

In [527]:
p = x.union.union(y)
p

{1, 2, 5, 10}

In [528]:
type(p)

set

In [564]:
p.union(z)

{1, 2, 5, 10, 20}

In [523]:
x.intersection(y)

{1, 2}

In [516]:
list(x)

[10, 1, 2]

In [517]:
list(y)

[1, 2, 5]

In [518]:
list(x) & list(y)

TypeError: unsupported operand type(s) for &: 'list' and 'list'

In [500]:
type(x)

set

In [479]:
l.sort()

In [ ]:
t.sort()

In [ ]:
t.sum()

In [454]:
sorted()

TypeError: sorted expected 1 argument, got 0

In [483]:
sort(l)

NameError: name 'sort' is not defined

In [484]:
sorted(t)

[1, 1, 1, 1, 1, 2, 3]

In [485]:
reversed(t)

# Dictionaries

In [565]:
x = ['a', 'b' ,'c']

In [566]:
x[0]

'a'

In [581]:
my_dict = dict()

In [584]:
my_dict.keys()

dict_keys([])

In [569]:
type(my_dict)

dict

In [570]:
my_dict = {}

In [571]:
type(my_dict)

dict

In [585]:
my_dict = {'first':'a','second':'b','third':'c'}

In [586]:
my_dict

{'first': 'a', 'second': 'b', 'third': 'c'}

In [587]:
type(my_dict)

dict

In [588]:
my_dict.keys()

dict_keys(['first', 'second', 'third'])

In [589]:
my_dict.items()

dict_items([('first', 'a'), ('second', 'b'), ('third', 'c')])

In [590]:
my_dict['second']

'b'

In [591]:
my_dict['first']

'a'

In [602]:
my_dict['fourth'] = 'd'

In [603]:
my_dict

{'first': 'a', 'second': 'b', 'third': 'c', 'fourth': 'd'}

In [604]:
my_dict.items()

dict_items([('first', 'a'), ('second', 'b'), ('third', 'c'), ('fourth', 'd')])

In [605]:
my_dict.keys()

dict_keys(['first', 'second', 'third', 'fourth'])

In [616]:
my_dict['third']

'c'

In [617]:
len(my_dict)

4

In [618]:
'first' in my_dict

True

In [619]:
'a' in my_dict

False

In [621]:
my_dict.values()

dict_values(['a', 'b', 'c', 'd'])

In [622]:
'a' in my_dict.values()

True

In [623]:
my_dict[5] = 'five'

In [624]:
my_dict

{'first': 'a', 'second': 'b', 'third': 'c', 'fourth': 'd', 5: 'five'}

In [625]:
my_dict['lst'] = [1,2,3,5,6]

In [626]:
my_dict

{'first': 'a',
 'second': 'b',
 'third': 'c',
 'fourth': 'd',
 5: 'five',
 'lst': [1, 2, 3, 5, 6]}

In [631]:
my_dict['lst'][4]

6

In [633]:
## Strings
## lists
## tuples
## Sets
## Dictionaries

# Conditions and Branching

In [634]:
type(True)

bool

In [637]:
type(False)

bool

In [640]:
x = 5

In [641]:
x >0 and x < 10

True

In [645]:
x > 7 or x < 10

True

In [646]:
x > 7

False

In [647]:
x < 10

True

In [648]:
#AND = any one condition false then False
#OR = and one condition True then True

In [657]:
x>5

False

In [651]:
not (x>5)

True

In [667]:
(x >0) and  (x < 10)

True

In [666]:
(x >0) or (x < 10)

True

In [668]:
not (x>5)

True

In [680]:
bool(0)

False

In [683]:
bool(0) and (x>4)

False

# IF statements

In [687]:
x = int(input())

 15

In [688]:
x

15

In [712]:
x = int(input())
if x > 10:
    y = x/2
    print(' input is greater than 10')
    print('half of input value is ', y )
else:
    print(' input is less than 10')

print('%s is entered value by user'%(x))

 5

In [732]:
choice = int(input())

if choice <= 10:
    if choice >= 0:
        print('Good Guess')
    else:
        print('negetive input')
elif choice <= 20:
    print('Close Guess')
elif choice <= 50:
    print('try again')
else:
    print('Bad Guess')

 -2

negetive input

In [733]:
pwd

'/Users/rahulgarg/github/aux_ai_engine/pycodes'